<template>
  <view class="p-4">
    <view class="text-lg">请家教方式</view>
    <br>
    <view>1、免费招聘:发布学员信息，符合的教员与您联系。或者挑选合适的教员预约TA。</view>
    <br>
    <view>2、付费招聘:挑选合适的教员支付费用与教员直接电话联系。</view>
    <br>
    <view>3、家长发布信息请选择个人，机构发布信息请选择机构</view>
    <br>
    <view class="text-lg">家教说明</view>
    <br>
    <view>
      1、试课说明:教员与您联系时，会先沟通学员情况、任教时间以及费用等，双方达成一致后，第一次上课，如果对教员不满意，本次免费。满意则计算费用。
    </view>
    <br>
    <view>2、教员身份说明:大学生教员(在校本科生)、研究生教员(在校研究生)、普通教员(已毕业，有一定的经验）和专业教员(多年的任教经验、执有对应教师资格。</view>
    <br>
    <view>3、任教费用及时间由双方协商。</view>
    <br>
    <view>4、注册的教员都通过了实名和学历认证，请放心聘请。</view>
  </view>
</template>
