<template>
    <view class="p-4">
        <view class="text-5 text-center font-500 mb-4 color-primary">《用户服务协议》及《隐私协议》</view>
        <view>
            <text class="inline-block w-4"></text>
            <text>
                1、服务条款的接受通过完成金鳌堂小程序注册程序，用户便表明其接受了本服务协议的条款，并同意受本服务协议的约束;同时，用户保证其提交的信息真实、准确、及时和完整。本服务协议所称的用户是指完全同意所有条款(以下简称“服务条款”)并完成注册程序的服务接受者。
            </text>
        </view>
        <br />
        <view>
            <text class="inline-block w-4"></text>
            <text>
                2、服务条款的变更和修改金鳌堂小程序保留依其自主判断在将来的任何时间变更、修改、增加或删除本服务协议条款的权利。所有修改的协议均构成本服务协议的一部分。小程序有权随时对服务条款进行修改，一旦发生服务条款的变动，小程序将提示修改的内容;当用户使用特殊服务时，应接受小程序随时提供的与该特殊服务相关的规则或说明，并且此规则或说明均构成本服务条款的一部分。用户如果不同意服务条款的修改，可以主动取消已经获得的网络服务;如果用户继续享用网络服务，则视为用户已经接受服务条款的修改。
            </text>
        </view>
        <br />
        <view>
            <text class="inline-block w-4"></text>
            <text>
                3、用户数据使用说明金鳌堂小程序收集的数据仅用于了解用户需求及教员资质，以保证更好的服务，并不会非法售卖。数据使用范围仅在本小程序内。当用户注销账号后，后台会相应删除相关数据。数据包括但不限于用户手机号码等。
            </text>
        </view>
        <br />
        <view class="text-lg font-600">隐私保护</view>
        <br />
        <view>
            <text class="inline-block w-4"></text>
            <text>
                1、金鳌堂小程序一定不会公开、编辑或透露用户的注册资料及保存在向日葵家教各项服务中的非公开内容，除非本小程序在诚信的基础上认为透露这些信息在以下几种情况是必要的:(1)遵守有关法律规定，包括在国家有关机关查询时，提供用户在向日葵家教的网页上发布的信息内容及其发布时间、互联网地址或者域名。(2)遵从金鳌堂小程序产品服务程序。(3)保持维护本小程序的商标所有权。(4)在紧急情况下竭力维护用户个人和社会大众的隐私安全。(5)向日葵家教认为必要的其他情况下。
            </text>
        </view>
        <br />
        <view>
            <text class="inline-block w-4"></text>
            <text>
                2、用户的帐号、密码和安全性您一旦注册成功成为用户，即可使用创建订单、查看订单、收藏信息、发布留言、教员注册、简历修改功能。在这些服务中，我们将获取您的手机号、住址(部分功能，如教员注册、简历修改)、基本信息(性别、就读院校、个人经历等)，通过这些信息，我们将完善您的个人信息。请相信我们不会以售卖您的信息获利，详情请见第1条。
            </text>
        </view>

    </view>
</template>